<a href="https://colab.research.google.com/github/libclick/DATA205/blob/main/strings_practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Import pandas library 
import pandas as pd 
import numpy as np

In [ ]:
#create panda series of active company name
active_series = pd.Series(active_names)
active_series

0     Bogus
1    madeup
2    Henrys
3     Arbys
dtype: object

In [ ]:
#create towing dataframe sample using list tuples then replace
column_tuples = [("TCL", "notes 222 Henrys"), ("TCL", "notes 333 HENRYS"), ("Henrys", "201/2 SomeCompany"), ("tcl", "201/2 henrys"), ("TCL", "what tcl 2/12 Bogus")]
towing = pd.DataFrame(column_tuples, columns=["story_company", "notes"]) 
towing

  story_company                notes
0           TCL     notes 222 Henrys
1           TCL     notes 333 HENRYS
2        Henrys    201/2 SomeCompany
3           tcl         201/2 henrys
4           TCL  what tcl 2/12 Bogus

In [ ]:
active_names = ('Bogus', 'madeup', 'Henrys', 'Arbys')

print(active_names)

('Bogus', 'madeup', 'Henrys', 'Arbys')

In [ ]:
towing.replace(to_replace="TCL", value="HELLO", inplace=False, limit=None, regex=True, method='pad')

  story_company                notes
0         HELLO     notes 222 Henrys
1         HELLO     notes 333 HENRYS
2        Henrys    201/2 SomeCompany
3           tcl         201/2 henrys
4         HELLO  what tcl 2/12 Bogus

# New Section

In [ ]:
  print(active_series.index)

RangeIndex(start=0, stop=4, step=1)

In [ ]:
#create towing dataframe sample using list tuples then replace
column_tuples = [("TCL", "notes 222 Henrys"), ("TCL", "notes 333 HENRYS"), ("Henrys", "201/2 SomeCompany"), ("TCL", "201/2 henrys"), ("TCL", "what tcl 2/12 Bogus")] 
towing = pd.DataFrame(column_tuples, columns=["story_company", "notes"]) 
towing

  story_company                notes
0           TCL     notes 222 Henrys
1           TCL     notes 333 HENRYS
2        Henrys    201/2 SomeCompany
3           TCL         201/2 henrys
4           TCL  what tcl 2/12 Bogus

In [ ]:
#create filtered new? towing_fix frames
towing_fix = towing[(towing["story_company"] == "TCL") | (towing["story_company"] == "tcl")]
towing_fix

  story_company                notes
0           TCL     notes 222 Henrys
1           TCL     notes 333 HENRYS
3           TCL         201/2 henrys
4           TCL  what tcl 2/12 Bogus

In [ ]:
#perfom string split on notes column, with notes column as a panda "fix" #with columns to compare against series

#towing_fix["notes"] = towing_fix.notes.str.title()      #capitalize on first letter of each word ??? same warning
towing_fix.loc[:,"notes"] = towing_fix.loc[:,"notes"].str.title()
fix = towing_fix["notes"].str.split(" ", n = 3, expand = True)   
print(fix)
type(fix)
max_row = len(fix)
print(max_row)

       0       1       2      3
0  Notes     222  Henrys   None
1  Notes     333  Henrys   None
3  201/2  Henrys    None   None
4   What     Tcl    2/12  Bogus
4

/usr/local/lib/python3.7/dist-packages/pandas/core/indexing.py:1781: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item_labels[indexer[info_axis]]] = value

In [ ]:
#x = -1
#while x<= 4 :
#  x = x+1
#  y = 0

#  if fix[4][3] in active_series:
    #dataframe.replace(to_replace = None, value=active_series, inplace = True, limit=None, flag = reIGNORECASE,regex=active_series, method=None, axis=None)
fix[2].replace({"Henrys": active_series.get(key = active_series, default=None)}, inplace=True)
    #fix.replace(to_replace=fix[1][2], value=active_series, inplace=True, limit=400, regex=False, method='pad')[source]
    #active_series.str.replace(fix[1][2], 'active', n=- 1, case=reIGNORECASE, flags=0, regex=True)
    #x=5 #tostop
fix

       0       1       2      3
0  Notes     222  Henrys   None
1  Notes     333  Henrys   None
3  201/2  Henrys    None   None
4   What     Tcl    2/12  Bogus